package com.nick.bot.commands;

public class BotCommands {
    public static final String START_TEMPLATE = "Привет %s! \nЯ помогу тебе превратить видео с YouTube в MP3. Просто скинь мне ссылку!";

    public static final String HELP_TEMPLATE = """
            🤖 **Как пользоваться ботом:**
            1. Найди видео на YouTube.
            2. Скопируй ссылку и отправь её мне.
            3. Подожди немного, пока я обработаю аудио.
            4. Наслаждайся треком в своём профиле!

            ⚠️ *Лимит на отправку файла — 50 МБ.*
            ⚙️ *Качество аудио — 192 kbps.*
            """;

    public static final String ERROR_DOWNLOAD = "❌ Ошибка скачивания. Проверь ссылку или попробуй позже.";
}
